swiftgeek/t2k-c8051/mscbemb.h
#define LED_0 P3 ^ 3
#define LED_ON 1
sbit RS485_ENABLE = P0 ^ 4;

/*--------------------------------*/
#elif defined(FGD_008)
#include <c8051F310.h>
#define  CPU_C8051F310

// Add a new entry for the T2K-FGD SiPM 8-channel bias board
// K. Mizouchi Sep/19/2006
//
// LED_0, which is used as a primary led in the system, is
// connected to a spare pin (NC) and secondary LED, LED_1,
// is made to be undefined. It is only used in mscbutil
// libraries and we don't have it physically.
//
// We define the SELECT_LED_DACX pin here, because we want to
// use led_xxxx() in mscbutil.c for DAC LED control.
#define LED_0 P2 ^ 4

#if defined(LED_1)
#undef LED_1
#endif

#define LED_2 P1 ^ 4
#define LED_3 P1 ^ 5
#define LED_4 P1 ^ 6
#define LED_5 P1 ^ 7
#define LED_6 P2 ^ 0
#define LED_7 P2 ^ 1
#define LED_8 P2 ^ 2
#define LED_9 P2 ^ 3

#define LED_ON 0

sbit RS485_ENABLE = P0 ^ 3;
/*--------------------------------*/
#elif defined(TSR)
#include <c8051F310.h>
#define  CPU_C8051F310

// A new entry for Temperature Sensor Array (TSR) test board
// Brian Lee   May/06/2007
//
// LED_0, which is used as a primary led in the system, is 
// connected to a spare pin (NC) and secondary LED, LED_1, 
// is made to be undefined. It is only used in mscbutil 
// libraries and we don't have it physically.
// 
 
#define LED_0 P1 ^ 7 

//LEDs used in TSR
#define TSRLED_1 P3 ^ 1
#define TSRLED_2 P3 ^ 2
#define TSRLED_3 P3 ^ 3
#define TSRLED_4 P3 ^ 4
#define TSRLED_5 P2 ^ 7
#define TSRLED_6 P2 ^ 6
#define TSRLED_7 P2 ^ 5

//The pins that are used for Threshold voltages for comparator 0 and comparator 1
#define SST1_REF P1 ^ 1
#define SST2_REF P1 ^ 0

#define MSCB_SST1 P2 ^ 0 //SST1 line
#define MSCB_SST2 P2 ^ 1 //SST2 line

#define SST1_ClientResponse P0 ^ 6 //Comparator 0 output
#define SST2_ClientResponse P0 ^ 7 //Comparator 1 output

#define LED_ON 0 //defines LED "ON" as forcing the specified pin to low

sbit P1_1 = SST1_REF; // the bit that controls and reads from P1 ^ 1
sbit P1_0 = SST2_REF; // the bit that controls and reads from P1 ^ 0

sbit RS485_ENABLE = P0 ^ 3; //MSCB communication enable port
/*--------------------------------*/
#elif defined(T2KASUM)
#include <c8051F310.h>
#define  CPU_C8051F310

// A new entry for T2K ASUM test board
// Brian Lee   Jun/07/2007
//
// LED_0, which is used as a primary led in the system, is 
// connected to a spare pin (NC) and secondary LED, LED_1, 
// is made to be undefined. It is only used in mscbutil 
// libraries and we don't have it physically.
// 
 
#define LED_0 P1 ^ 7 
#if defined(LED_1) 
#undef LED_1
#endif

/*LEDs used in TSR
#define TSRLED_1 P3 ^ 1
#define TSRLED_2 P3 ^ 2
#define TSRLED_3 P3 ^ 3
#define TSRLED_4 P3 ^ 4
#define TSRLED_5 P2 ^ 7
#define TSRLED_6 P2 ^ 6
#define TSRLED_7 P2 ^ 5*/

//The pins that are used for Threshold voltages for comparator 0 and comparator 1
#define SST1_REF P2 ^ 1
//#define SST2_REF P1 ^ 0

#define MSCB_SST1 P2 ^ 0 //SST1 line
//#define SST2 P2 ^ 1 //SST2 line

#define SST_ClientResponse (char) ((CPT0CN & 0x40) >> 6)
#define SST1_ClientResponse P0 ^ 6 //Comparator 0 output
#define SST2_ClientResponse P0 ^ 7 //Comparator 1 output

#define LED_ON 0 //defines LED "ON" as forcing the specified pin to low

sbit P2_1 = SST1_REF; // the bit that controls and reads from P1 ^ 1
//sbit P1_0 = SST2_REF; // the bit that controls and reads from P1 ^ 0

#define MSCB_I2C_SDA P0 ^ 0
#define MSCB_I2C_SCL P0 ^ 1

#define MSCB_SPI_SCK P0 ^ 7
#define MSCB_SPI_MISO P1 ^ 2
#define MSCB_SPI_MOSI P1 ^ 3

sbit RS485_ENABLE = P0 ^ 3; //MSCB communication enable port

/*--------------------------------*/
#elif defined(FEB64)
#include <c8051F120.h>
#define CPU_C8051F120

#define LED_0 P1 ^ 2 
#if defined(LED_1) 
#undef LED_1
#endif

 // SST
//The pins that are used for Threshold voltages for comparator 0 and comparator 1
#define MSCB_SST1 P1 ^ 0 //SST1 line  SST_IO (Write/Push-Pull)
#define SST_ClientResponse1 (char) ((CPT1CN & 0x40) >> 6) //Comparator1 overflow bit

#define LED_ON 0 //defines LED "ON" as forcing the specified pin to low
// SMB
#define MSCB_I2C_SDA P0 ^ 2
#define MSCB_I2C_SCL P0 ^ 3

// SPI
#define MSCB_SPI_SCK  P2 ^ 3
#define MSCB_SPI_MISO P2 ^ 1
#define MSCB_SPI_MOSI P2 ^ 4

sbit RS485_ENABLE = P0 ^ 5; //MSCB communication enable port
/*--------------------------------*/
#elif defined(TEMP36)
#include <c8051F120.h>
#define CPU_C8051F120
#define LED_0 P2 ^ 7 
#define LED_1 P2 ^ 6
#define LED_ON 1
sbit RS485_ENABLE = P0 ^ 2; //MSCB communication enable port

// SST
#define MORE_THAN_ONE_LINE	//2 SST Lines
#define MSCB_SST1 P0^3 //SST1 line  SST_IO (Write/Push-Pull)
#define MSCB_SST2 P0^4
#define SST_ClientResponse1 (char) ((CPT0CN & 0x40) >> 6) //Comparator1 overflow bit
#define SST_ClientResponse2 (char) ((CPT1CN & 0x40) >> 6)

//SPI
#define MSCB_SPI_SCK  P2 ^ 4
#define MSCB_SPI_MISO P2 ^ 1
#define MSCB_SPI_MOSI P2 ^ 5 

#define HAVE_RTC

//SHT
#define SHT_DATA1 P1^2
#define SHT_SCK1  P1^0
#define SHT_DATA2 P1^6
#define SHT_SCK2  P1^4
/*--------------------------------*/
#elif defined(LOADER)
#include <c8051F120.h>
#define CPU_C8051F120

#if defined(LED_1) 
#undef LED_1
#endif

#define LED_ON 0 //defines LED "ON" as forcing the specified pin to low

// SPI
#ifdef L_TEMP36
#define MSCB_SPI_SCK  P2 ^ 4
#define MSCB_SPI_MISO P2 ^ 1
#define MSCB_SPI_MOSI P2 ^ 5
#define RAM_CHIP_SELECT    P2 ^ 0
#define RAM_HOLD_DOWN      P2 ^ 3
#define RAM_WRITE_PROTECT  P2 ^ 2
#define LED_0 P2 ^ 7 
sbit RS485_ENABLE = P0 ^ 2; //MSCB communication enable port
#elif defined(L_FEB64)
#define MSCB_SPI_SCK  P2 ^ 3
#define MSCB_SPI_MISO P2 ^ 1
#define MSCB_SPI_MOSI P2 ^ 4
#define RAM_CHIP_SELECT    P3 ^ 7
#define RAM_HOLD_DOWN      P2 ^ 2
#define RAM_WRITE_PROTECT  P2 ^ 0
#define LED_0 P2 ^ 7 
sbit RS485_ENABLE = P0 ^ 5; //MSCB communication enable port
#elif defined(L_CMB)
#define MSCB_SPI_SCK  P2 ^ 3
#define MSCB_SPI_MISO P2 ^ 1
#define MSCB_SPI_MOSI P2 ^ 4
#define RAM_CHIP_SELECT    P3 ^ 7
#define RAM_HOLD_DOWN      P2 ^ 2
#define RAM_WRITE_PROTECT  P2 ^ 0
#define LED_0 P2 ^ 7 
sbit RS485_ENABLE = P0 ^ 5; //MSCB communication enable port
#elif defined(L_LPB)
#define MSCB_SPI_SCK  P2 ^ 3
#define MSCB_SPI_MISO P2 ^ 1
#define MSCB_SPI_MOSI P2 ^ 4
#define RAM_CHIP_SELECT    P3 ^ 7
#define RAM_HOLD_DOWN      P2 ^ 2
#define RAM_WRITE_PROTECT  P2 ^ 0
#define LED_0 P2 ^ 7 
sbit RS485_ENABLE = P0 ^ 5; //MSCB communication enable port
#endif

/*--------------------------------*/
#elif defined(CMB)
#include <c8051F120.h>
#define CPU_C8051F120

#define LED_0 P2 ^ 7 
#if defined(LED_1) 
#undef LED_1
#endif
 
#define LED_ON 0 //defines LED "ON" as forcing the specified pin to low


//The pins that are used for Threshold voltages for comparator 0 and comparator 1
#define MSCB_SST1 P1 ^ 0 //SST1 line  SST_IO (Write/Push-Pull)
#define SST_ClientResponse1 (char) ((CPT1CN & 0x40) >> 6) //Comparator1 overflow bit

sbit RS485_ENABLE = P0 ^ 5; //MSCB communication enable port

/*--------------------------------*/
#elif defined(LPB)
#include <c8051F120.h>
#define CPU_C8051F120

#define LED_0 P0 ^ 7 
#if defined(LED_1) 
#undef LED_1
#endif
 
#define LED_ON 0 //defines LED "ON" as forcing the specified pin to low

//The pins that are used for Threshold voltages for comparator 0 and comparator 1
#define MSCB_SST1 P1 ^ 0 //SST1 line  SST_IO (Write/Push-Pull)
#define SST_ClientResponse1 (char) ((CPT1CN & 0x40) >> 6) //Comparator1 overflow bit

// SPI
#define MSCB_SPI_SCK  P2 ^ 3
#define MSCB_SPI_MOSI P2 ^ 4
#define MSCB_SYNC     P1 ^ 1
#define MSCB_SPI_MISO P2 ^ 1

//SHT
#define SHT_DATA1 P1^4
#define SHT_SCK1  P1^5

sbit RS485_ENABLE = P0 ^ 5; //MSCB communication enable port
/*--------------------------------*/
#elif defined(GPIB_TEST)
#include <c8051F020.h>
#define CPU_C8051F020

